<a href="https://colab.research.google.com/github/oluwadamiloju/python-classwork/blob/main/starter_stuff.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [10]:
hires_df = pd.read_csv("PastHires.csv")

In [13]:
hires_df.head(3)

   Years Experience Employed?  ...  Interned Hired
0                10         Y  ...         N     Y
1                 0         N  ...         Y     M
2                 7         N  ...         N     N

[3 rows x 7 columns]

In [15]:
hires_df.tail(7)

    Years Experience Employed?  ...  Interned Hired
6                  5         Y  ...         Y     Y
7                  3         N  ...         Y     Y
8                 15         Y  ...         N     Y
9                  0         N  ...         N     N
10                 1         N  ...         N     N
11                 4         Y  ...         Y     Y
12                 0         N  ...         N     M

[7 rows x 7 columns]

In [16]:
hires_df.shape

(13, 7)

In [17]:
hires_df.size

91

In [18]:
len(hires_df)

13

In [19]:
hires_df.columns

Index(['Years Experience', 'Employed?', 'Previous employers',
       'Level of Education', 'Top-tier school', 'Interned', 'Hired'],
      dtype='object')

In [21]:
hires_df_series = hires_df['Years Experience']

In [22]:
hires_df['Years Experience']

0     10
1      0
2      7
3      2
4     20
5      0
6      5
7      3
8     15
9      0
10     1
11     4
12     0
Name: Years Experience, dtype: int64

In [23]:
hires_df_series[:5]

0    10
1     0
2     7
3     2
4    20
Name: Years Experience, dtype: int64

In [24]:
hires_df_series[5]

0

In [25]:
hires_df[['Years Experience', 'Hired']]

    Years Experience Hired
0                 10     Y
1                  0     M
2                  7     N
3                  2     Y
4                 20     N
5                  0     M
6                  5     Y
7                  3     Y
8                 15     Y
9                  0     N
10                 1     N
11                 4     Y
12                 0     M